Configuration_correct2/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияДоговораНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияДоговораОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Configuration_correct2/src/CommonModules/ВКМ_РаботаСФормойСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервере(Форма) Экспорт       
	
	//{{ВКМ_ Добавление реквизитов в справочники 
	СписокФорм = Новый СписокЗначений();
	//Добавление реквизитов абонентского договора
	СписокФорм.Добавить("Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента");
	//Добавление реквизитов бонентского договора
	СписокФорм.Добавить("Справочник.Пользователи.Форма.ФормаЭлемента");

	//ИмяФормыВСписке = СписокФорм.НайтиПоЗначению(Форма.ИмяФормы);
	
	Если Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" тогда 

		ГруппаА= Форма.Элементы.Добавить("ВКМ_ГруппаАбонент", тип("ГруппаФормы"), Форма);
		ГруппаА.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаА.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;      
		
		ГруппаБ= Форма.Элементы.Добавить("ВКМ_ГруппаДаты", тип("ГруппаФормы"), ГруппаА);
		ГруппаБ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаБ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;      
 	
		ПолеПериодДействияДоговораНачало = Форма.Элементы.Добавить("ВКМ_ПериодДействияДоговораНачало", Тип("ПолеФормы"), ГруппаБ);
		ПолеПериодДействияДоговораНачало.Вид = ВидПоляФормы.ПолеВвода;     
		ПолеПериодДействияДоговораНачало.Заголовок = "Начало обслуживания";
		ПолеПериодДействияДоговораНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговораНачало"; 

		ПолеПериодДействияДоговораОкончание = Форма.Элементы.Добавить("ВКМ_ПериодДействияДоговораОкончание", Тип("ПолеФормы"), ГруппаБ);
		ПолеПериодДействияДоговораОкончание.Вид = ВидПоляФормы.ПолеВвода;     
		ПолеПериодДействияДоговораОкончание.Заголовок = "Окончание обслуживания";
		ПолеПериодДействияДоговораОкончание.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговораОкончание"; 

		ПолеСуммаАбонентскойПлаты = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаА);
		ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;     
		ПолеСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
		ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты"; 

		ПолеСуммаАбонентскойПлаты = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаА);
		ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;     
		ПолеСуммаАбонентскойПлаты.Заголовок = "Стоимость часа работы";
		ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
		
		ГруппаА.Видимость = Ложь;      

	КонецЕсли;
	
	//Если Форма.ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" тогда 

	//	ПолеСуммаАбонентскойПлаты = Форма.Элементы.Добавить("ВКМ_Оклад", Тип("ПолеФормы"), Форма);
	//	ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;     
	//	ПолеСуммаАбонентскойПлаты.Заголовок = "Оклад";
	//	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_Оклад"; 

	//	ПолеСуммаАбонентскойПлаты = Форма.Элементы.Добавить("ВКМ_ПроцентОтРабот", Тип("ПолеФормы"), Форма);
	//	ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;     
	//	ПолеСуммаАбонентскойПлаты.Заголовок = "Процент от работ";
	//	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_ПроцентОтРабот"; 
	//	
	//КонецЕсли;	
	
	Если Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" тогда 

		//Добавление команды формы
		Команда = Форма.Команды.Добавить("ВКМ_Заполнить"); //Имя команды
		Команда.Заголовок = "Заполнить";
		Команда.Действие  = "ВКМ_Заполнить"; //Имя связанной процедуры
	
		//Добавление кнопки формы
		КнопкаФормы = Форма.Элементы.Добавить("Заполнитъь", //Имя кнопки
										Тип("КнопкаФормы"),//Тип, всегда КнопкаФормы
										Форма.Элементы.ФормаКоманднаяПанель);//Контейнер для кнопки (Форма, Группа, Командная панель)
		КнопкаФормы.ИмяКоманды = "ВКМ_Заполнить"; //Связь с командой по имени

	КонецЕсли;

	//}}	
КонецПроцедуры 

#КонецОбласти
